---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayPatternFill
source: html/52aeaf04-c0b8-96c2-c33f-25ecfe5364f2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayPatternFill Property

"Pattern Fill"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceDisplayPatternFill { get; }
```